import sys
sys.stdout.reconfigure(encoding="utf-8")
import requests
import json

matn = """КУРГАН
ВОДИЙ
ЮК ТАХТА
ПАГРУЗКА  20/04/26
ОПЛАТА НАЛ
🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥

🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥

КРАСНОДАР
ХОРАЗМ
ЮК   ШАКАР
22 ТОННА
ГРУЗ ГОТОВ
ХАР. КУНИ
СРОЧНО СРОЧНО
🔥🔥🔥🔥
🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥

БЕЛАРУСЬ МИНСК
МАЛАДЕЧНО
ТОШКЕНТ


БЕЛАРУСЬ. ЧЕРВЕНЬ
НАМАНГАН


БЕЛАРУСЬ. ВИТЕБСКАЯ
ДОКШИЦИ
ТОШКЕНТ


БЕЛАРУСЬ. РЕЧИЦА
НАМАНГАН 


ХАММА  ЮК. ТАХТА
ВЕСЬ 23,5. 24 ТОННА 
ГЛОНАСС КЕРАК 
ДОКУМЕНТ РАБОЧНИЙ ДЕНЬ 


97 182 37 83 
ВАТСАП МАХ 

998 77 194 73 74 
ТЕЛЕГРАМ 
🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥


ТОМСК  УЛУ ЮЛДАН

ВОДИЙГА ЮК БОР

АВАНС ЕСТЬ
ОПЛАТА НАЛ

97182 37 83
ВАТСАП МАХ

998 77 194 73 74
ТЕЛЕГРАМ

СРОЧНО СРОЧНО
🔥🔥🔥🔥🔥🔥🔥🔥🔥
🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥
🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥

ТОМСК     АСИНОДАН

ВОДИЙГА

ЮК  БОР 
ЮК ТАХТА 
23 ТОННА 
ОПШИ  39  ТОННА 

ОПЛАТА НАЛ 
СРОЧНО СРОЧНО 

97182 37 83 
ВАТСАП МАХ 

998 77 194 73 74 
ТЕЛЕГРАМ 
💥💥💥💥💥💥💥💥💥💥
💥💥💥💥💥💥💥💥💥💥💥💥 







🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥










🔥🔥🔥🔥🔥🔥🔥🔥🔥

ИРКУТСКИЙ

ТОШКЕНТ

ГРУЗ. ЦИЛИНДРОВКА

ОПЛАТА НАЛ

СРОЧНО СРОЧНО

97182 37 83
ВАТСАП МАХ

998 77 194 73 74
ТЕЛЕГРАМ
🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥
🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥


КУРГАН  

ТОШКЕНТ  НАЗАРБЕККА 

ЮК ТАХТА 

ПАГРУЗКА   27 /04 /26

ОПЛАТА НАЛ 

АВАНС ЕСТЬ 

97182 37 83 
ВАТСАП МАХ 

998 77 194 73 74 
ТЕЛЕГРАМ 

💥💥💥💥💥💥💥💥💥💥 


КУРГАН 

ВОДИЙ 

ЮК   ТАХТА 

💥💥💥💥💥💥💥💥💥💥💥
💥💥💥💥💥💥💥💥💥💥💥 

💥💥💥💥💥💥💥💥💥💥
🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥


ХОРАЗМ.     

ИВАНОВНО  (РОССИЯ)

РАСТАМОЖКА. САРАТОВ

НУЖЕН. 1 ТЕНТ  96  СТАНДАРТ

ГРУЗ   ПРЯЖА
ТУРКМАН    ЮК

Дазвол   керак

🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥


🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥








💥💥💥💥💥💥💥💥💥💥💥 


🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥

97182 37 83
ВАТСАП МАХ

998 77 194 73 74
ТЕЛЕГРАМ

💥💥🔥🔥🔥🔥🔥🔥🔥🔥


КУРСКИЙ

ТОШКЕНТ

ЮК   АРПА

ВЕС :22. ТОННА

АВТО. 

ГРУЗ.  ГОТОВ

97182 37 83
ВАТСАП МАХ

998 77 194 73 74
ТЕЛЕГРАМ"""

response = requests.post(
    "http://localhost:8000/parse",
    json={"matn": matn}
)

print(json.dumps(response.json(), ensure_ascii=False, indent=2))
